# FieldDomainPointsByUV Methods

---
The FieldDomainPointsByUV type exposes the following members.
| Name| Description
---|---|---
| Dispose| (Inherited from FieldDomainPoints)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| SetGridCoordinates|
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
FieldDomainPointsByUV Class
Autodesk.Revit.DB.Analysis Namespace